### Ranking Analysis

Overview:
- Assigns rankings to records based on specified metrics and criteria
- Evaluates relative performance across data points
Key Functions:
- Ranking Functions: RANK(), DENSE_RANK(), ROW_NUMBER(), TOP
- Essential Clauses: GROUP BY, ORDER BY
- Clauses: GROUP BY, ORDER BY

In [ ]:
# Import required libraries
import pandas as pd
from sqlalchemy import create_engine
import os
from dotenv import load_dotenv
%load_ext sql
from IPython.display import Image, display

# Load environment variables
load_dotenv()

# Configure pandas display format
pd.options.display.float_format = '{:.2f}'.format

# Get database credentials from environment variables
DB_PASSWORD = os.getenv('DB_PASSWORD')

# Set the DATABASE_URL environment variable explicitly
os.environ['DATABASE_URL'] = f"postgresql://postgres:{DB_PASSWORD}@localhost:5432/contoso_100k"

# Connect using the environment variable
%sql ${DATABASE_URL}

# Enable automatic conversion of SQL results to pandas DataFrames
%config SqlMagic.autopandas = True

# Disable named parameters for SQL magic
%config SqlMagic.named_parameters = "disabled"

# Test the connection with a simple query
%sql SELECT version();

Connecting to 'postgresql://postgres:***@localhost:5432/contoso_100k'

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

1 rows affected.

                                             version
0  PostgreSQL 17.4 on x86_64-windows, compiled by...

### Ranking TOP 5 Best Performing products

In [5]:
%%sql
SELECT 
    p.productname,
    SUM(s.quantity * s.netprice * s.exchangerate) AS total_revenue
FROM sales s
LEFT JOIN product p 
    ON p.productkey = s.productkey
GROUP BY p.productname
ORDER BY total_revenue DESC
LIMIT 5;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

5 rows affected.

                                   productname  total_revenue
0              WWI Desktop PC2.33 X2330 Silver     1978563.54
1   Adventure Works Desktop PC2.33 XD233 Black     1930923.36
2   Adventure Works Desktop PC2.33 XD233 White     1856510.82
3               WWI Desktop PC2.33 X2330 Brown     1774293.33
4  Adventure Works Desktop PC2.33 XD233 Silver     1773019.12

### Replicating with windows function
with windows function you have the flexibility of adding rank

In [9]:
%%sql

SELECT *
FROM (
    SELECT
        p.productname,
        SUM(s.quantity * s.netprice * s.exchangerate) AS total_revenue,
        RANK() OVER (ORDER BY SUM(s.quantity * s.netprice * s.exchangerate) DESC) AS rank_products
    FROM sales s
    LEFT JOIN product p
        ON p.productkey = s.productkey
    GROUP BY p.productname
) AS ranked_products
WHERE rank_products <= 5;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

5 rows affected.

                                   productname  total_revenue  rank_products
0              WWI Desktop PC2.33 X2330 Silver     1978563.54              1
1   Adventure Works Desktop PC2.33 XD233 Black     1930923.36              2
2   Adventure Works Desktop PC2.33 XD233 White     1856510.82              3
3               WWI Desktop PC2.33 X2330 Brown     1774293.33              4
4  Adventure Works Desktop PC2.33 XD233 Silver     1773019.12              5

#### Rewriting it with limit

In [ ]:
%%sql
    SELECT
        p.productname,
        SUM(s.quantity * s.netprice * s.exchangerate) AS total_revenue,
        RANK() OVER (ORDER BY SUM(s.quantity * s.netprice * s.exchangerate) DESC) AS rank_products
    FROM sales s
    LEFT JOIN product p
        ON p.productkey = s.productkey
    GROUP BY p.productname
LIMIT 5

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

5 rows affected.

                                   productname  total_revenue  rank_products
0              WWI Desktop PC2.33 X2330 Silver     1978563.54              1
1   Adventure Works Desktop PC2.33 XD233 Black     1930923.36              2
2   Adventure Works Desktop PC2.33 XD233 White     1856510.82              3
3               WWI Desktop PC2.33 X2330 Brown     1774293.33              4
4  Adventure Works Desktop PC2.33 XD233 Silver     1773019.12              5

### top 10 customers who have generated the highest revenue

In [19]:
%%sql
select * from customer limit 5

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

5 rows affected.

,customerkey,geoareakey,startdt,enddt,continent,gender,title,givenname,middleinitial,surname,...,zipcode,country,countryfull,birthday,age,occupation,company,vehicle,latitude,longitude
0,15,4,1990-09-10,2034-07-29,Australia,male,Mr.,Julian,A,McGuigan,...,4357,AU,Australia,1965-03-24,55,Border Patrol agent,Cut Rite Lawn Care,2000 Peugeot Kart Up,-27.83,151.17
1,23,8,1995-08-11,2045-01-26,Australia,female,Ms.,Rose,H,Dash,...,6055,AU,Australia,1990-05-10,30,Agricultural and food scientist,Rack N Sack,2005 Volvo XC90,-31.92,116.05
2,36,2,1992-03-12,2044-05-14,Australia,female,Ms.,Annabelle,J,Townsend,...,2304,AU,Australia,1964-07-16,56,Special education teacher,id Boutiques,1999 Lancia Lybra,-32.88,151.71
3,120,6,1983-07-23,2033-08-09,Australia,male,Mr.,Jamie,H,Hetherington,...,7256,AU,Australia,1946-12-11,74,Dental laboratory technician,Showbiz Pizza Place,2006 Dodge Durango,-39.77,144.02
4,180,7,1987-11-26,2026-10-14,Australia,male,Mr.,Gabriel,P,Bosanquet,...,3505,AU,Australia,1955-04-24,65,Administrative support specialist,Dubrow's Cafeteria,1995 Morgan Plus 4,-34.13,142.14

In [21]:
%%sql
SELECT 
    c.customerkey,
    c.givenname,
    c.surname,
    SUM(s.quantity * s.netprice * s.exchangerate) AS total_revenue
FROM sales s
LEFT JOIN customer c
    ON c.customerkey = s.customerkey
GROUP BY 
    c.customerkey,
    c.givenname,
    c.surname
ORDER BY total_revenue DESC
LIMIT 10;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

   customerkey givenname    surname  total_revenue
0        72844       Ben  Davenport       82057.67
1       399184     Peter  Rodriguez       79201.82
2      1743963  Patricia     Dalton       65431.98
3      1232832     James   Thompson       62460.01
4       326979    Robert      Young       61349.65
5       368574   Chelsea   Pfeiffer       60644.48
6       552225    Janina      Unger       56240.85
7      1375597     David      Green       56073.21
8      1852945     James  McClendon       55994.75
9      1715500    Albert      Kloss       51550.86

#### The 3 customers with the fewest orders placed and thier order value

In [39]:
%%sql
SELECT
    c.customerkey,
    c.givenname,
    c.surname,
    COUNT(DISTINCT orderkey) AS total_orders,
    (
        SUM(s.quantity * s.netprice * s.exchangerate) / 
        NULLIF(COUNT(DISTINCT orderkey), 0) 
    ) :: float AS average_order_value
FROM sales s
LEFT JOIN customer c
    ON c.customerkey = s.customerkey
GROUP BY 
    c.customerkey,
    c.givenname,
    c.surname
ORDER BY average_order_value ASC
LIMIT 10;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

   customerkey givenname         surname  total_orders  average_order_value
0       612844   Heloise          Busson             1                 1.52
1       447646     Ralph         Pfeffer             1                 2.55
2       881751    Marein  Schoonderwoerd             1                 2.98
3      1035383     Elise          Hughes             1                 3.14
4      1064373      John           Leach             1                 3.27
5       935474     Lilly         Perkins             1                 3.28
6      1012195   Matilda         Peacock             1                 3.33
7      1575730     Kevin         Morning             1                 3.35
8      1037699       Zak          Watson             1                 3.36
9      1166357     Daisy           Tyler             1                 3.39